{
  "information": {
    "name": "Jónas Grétar Jónasson",
    "image": "profile.jpg",
    "about": "With over five years of experience developing hardware and software in the cycling industry, I can deliver end-to-end solutions for a wide range of problems."
  },
  "sections": [
    {
      "title": "Work experience",
      "entries": [
        {
          "title": "R&D systems engineer",
          "subtitle": "Swiss Side Technologies AG, Thalwil, Switzerland.",
          "start": "2018",
          "end": "2023",
          "body": "Developed, deployed and maintained a performance simulation platform for a world tour cycling team. Was a part of a two person team which developed a data acquisition system for wind tunnels, leveraging on-site and cloud infrastructure with an online report generation platform. Developed algorithms for performance simulation and data post-processing. Designed wind tunnel and on-road measurement equipment for the cycling industry."
        },
        {
          "title": "Support Engineer & Intern",
          "subtitle": "Swiss Side Technologies AG, Thalwil, Switzerland.",
          "start": "2017",
          "end": "2018",
          "body": "Assisted with processing of wind tunnel and CFD data for bicycle design projects."
        },
        {
          "title": "Intern, Energy Production department",
          "subtitle": "Verkís Consulting Engineers, Reykjavík, Iceland",
          "start": "2016",
          "end": "2016",
          "body": "Drew metal structures for hydropower plants. Implemented 3D CAD workflows for technical drawings. Reviewed subcontractor calculations for machinery."
        },
        {
        }
      ]
    },
    {
      "title": "Education",
      "entries": [
        {
          "title": "Mechanical Engineering MSc",
          "subtitle": "ETH Zürich, Switzerland",
          "start": "2016",
          "end": "2018",
          "body": "<i>Laboratory of Composite Materials and Adaptive Structures</i><br>Specializing in algorithms for structural optimization. Master thesis was a design study where a novel computational framework for optimization and simulation of patched laminates was developed. This was later adapted and <a href=\"https://doi.org/10.1007/s00158-019-02311-w\">published</a>.<br><br><i>Overall average grade: 5.52 / 6</i>"
        },
        {
          "title": "Mechanical Engineering BSc",
          "subtitle": "University of Iceland, Reykjavík",
          "start": "2014",
          "end": "2016",
          "body": "Degree finished in two and a half years. First grade with distinction. Member of the formula student team, <i>Team Spark</i>, for two years."
        }
      ]
    },
    {
      "entries": [
        {
          "body": "This is still a work in progress!"
        }
      ]
    }
  ]
}