{
  "information": {
    "name": "Jónas Grétar Jónasson",
    "image": "profile.jpg",
    "about": "With over five years of experience developing hardware and software in the cycling industry, I can deliver end-to-end solutions to a wide range of problems."
  },
  "sections": [
    {
      "title": "Key competencies",
      "entries": [
        {
          "body": "<li>Avid learner and problem solver</li>"
        },
        {
          "body": "<li>Fullstack application development and deployment</li>"
        },
        {
          "body": "<li>Algorithm development, modeling and data analysis</li>"
        },
        {
          "body": "<li>Embedded system firmware development, specification and design of measurement electronics</li>"
        }
      ]
    },
    {
      "title": "Work experience",
      "entries": [
        {
          "title": "Full-stack engineer",
          "subtitle": "Taskbase AG, Zürich, Switzerland.",
          "start": "03.2024",
          "end": "",
          "body": ""
        },
        {
          "title": "R&D systems engineer",
          "subtitle": "Swiss Side Technologies AG, Thalwil, Switzerland.",
          "start": "11.2023",
          "end": "02.2024",
          "body": "Part time on a project basis."
        },
        {
          "title": "R&D systems engineer",
          "subtitle": "Swiss Side Technologies AG, Thalwil, Switzerland.",
          "start": "2018",
          "end": "10.2023",
          "body": "Drove R&D projects from ideas to reality. Developed, deployed and maintained a performance simulation platform for a world tour cycling team. Was a part of a two person team which developed a data acquisition system for wind tunnels, leveraging on-site and cloud infrastructure with an online report generation platform. Developed algorithms for performance simulation and data post-processing. Designed wind tunnel and on-road measurement equipment for the cycling industry."
        },
        {
          "title": "Support Engineer & Intern",
          "subtitle": "Swiss Side Technologies AG, Thalwil, Switzerland.",
          "start": "2017",
          "end": "2018",
          "body": "Assisted with processing of wind tunnel and CFD data for bicycle design projects."
        },
        {
          "title": "Intern, Energy Production department",
          "subtitle": "Verkís Consulting Engineers, Reykjavík, Iceland",
          "start": "2016",
          "end": "2016",
          "body": "Drew metal structures for hydropower plants. Implemented 3D CAD workflows for technical drawings. Reviewed subcontractor calculations for machinery."
        },
        {
          "title": "Teaching Assistant, Numerical Analysis",
          "subtitle": "University of Iceland, Reykjavík, Iceland",
          "start": "2016",
          "end": "2016",
          "body": "Part time. Reviewed student assignments and projects. Taught exercise hours."
        }
      ]
    },
    {
      "title": "Education",
      "entries": [
        {
          "title": "Mechanical Engineering MSc",
          "subtitle": "ETH Zürich, Switzerland",
          "start": "2016",
          "end": "2018",
          "body": "<i>Laboratory of Composite Materials and Adaptive Structures</i><br>Specializing in anisotropic materials and structural optimization. Master thesis was a design study where a novel computational framework for optimization and simulation of patched laminates was developed. This was later adapted and <a href=\"https://doi.org/10.1007/s00158-019-02311-w\">published</a>.<br><br><i>Overall average grade: 5.52 / 6</i>"
        },
        {
          "title": "Mechanical Engineering BSc",
          "subtitle": "University of Iceland, Reykjavík",
          "start": "2014",
          "end": "2016",
          "body": "Degree finished in two and a half years. First grade with distinction. Member of the formula student team, <i>Team Spark</i>, for two years."
        }
      ]
    },
    {
      "title": "Projects",
      "entries": [
        {
          "title": "Performance simulation platform for a world tour cycling team",
          "body": "In collaboration with a World Tour cycling team, I developed a performance simulation platform for optimizing race pacing strategies. The initial version was a monolith VM running a Flask app combined with a SQL database. For its second release it was rebuilt using a range of Google Cloud Platform (GCP) cloud native products (Firestore / Cloud Run / PubSub / Buckets) with a Vue.js web app as a frontend. The application was deployed using Gitlab CI/CD."
        },
        {
          "title": "Wind tunnel data-acquisition & control system with analysis platform",
          "body": "We built a data-acquisition & control system for our wind tunnels. It was deployed partially on-premise and partially in the cloud. Locally the system used an MQTT-based IoT message bus to gather data and control the wind tunnel which comprised of multiple Dockers applications controlling pieces of hardware, deployed using Ansible. The local data was then transferred to the cloud (GCP), where we developed a full-stack web application (using a similar technologies as the performance simulation platform mentioned above) for data analysis and reporting."
        },
        {
          "title": "An on-bike aerodynamic drag measurement device.",
          "body": "For my internship at Swiss Side I designed an Arduino-based data logger for wind speed and angle measurements. After joining full-time, I was the sole person responsible for the project’s development. I upgraded the device to a custom PCB with an NRF52 microcontroller, incorporating BLE, ANT+ radios, GNSS positioning, and other sensors with a custom firmware. Later a second engineer joined the team and we further developed the firmware, data processing and a web-based post-processing platform. With an external partner we aimed to bring the device to market, but the project stopped after reaching the MVP stage."
        }
      ]
    },
    {
      "title": "Skills",
      "entries": [
        {
          "title": "Languages",
          "body": "Icelandic <i>native</i>, English <i>fluent</i>, German and Swiss German <i>very good</i></li></ul>"
        },
        {
          "title": "Programming languages",
          "body": "Python, C, JavaScript (+HTML/CSS), Java"
        },
        {
          "title": "Operating systems",
          "body": "MacOs, Linux, Windows"
        },
        {
          "title": "Software technologies",
          "body": "Git, Ansible, Docker, Vue.js, Zephyr RTOS, Numpy, Pandas, Flask, Google Cloud Platform (GCP)"
        },
        {
          "title": "Engineering tools",
          "body": "Visual Studio Code, KiCad, Segger Embedded Studio (SES), CAD experience in Siemens NX, Autodesk Inventor, FreeCad"
        }
      ]
    },
    {
      "title": "More about me",
      "entries": [
        {
          "body": "Born and raised in Iceland, I moved to Switzerland seven years ago to pursue a Master’s degree in mechanical engineering. During my thesis and internship, my interest shifted towards software and electronics, a transition which now sees me focusing on software engineering. I am eager to apply my multidisciplinary background to solve complex and interesting problems."
        },
        {
          "title": "Hobbies",
          "body": "All things cycling, road cycling, gravel cycling, building and maintaining bikes, watching bike races and doing the occasional bike event. When I am not doing bike related things I like to do other projects like up-cycling old furniture or hi-fi gear."
        },
        {
          "title": "Motivation",
          "body": "Working in small teams of talented individuals, solving interesting problems with opportunities to learn new things and see the impact of our work is what motivates me."
        }
      ]
    }
  ]
}
